import AllFlower.Bouquet;
import AllFlower.Flower;
import Transport.Bus;
import Transport.Car;
import Transport.Train;

public class Main {
    public static void main(String[] args) {
        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        /////////////////////////////////////Люди///////////////////////////////////////////////////////////////////////
        System.out.println("++++++++++Люди++++++++++");
        Human maksim = new Human("Максим", 35, "", " ");
        Human anna = new Human("Аня", 29, "Москва", "методист образовательных программ");
        Human katya = new Human("Катя", 28, "Калининград", "продакт-менеджером");
        Human artem = new Human("Артем", 27, "Москв", "директором по развитию бизнеса");
        Human vladimir = new Human("Владимир", 21, "Казань", "нигде не работает");
        System.out.println(maksim.toString());
        System.out.println("-----------------------------------------------------------------------------------------");

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        /////////////////////////////////////Цветы//////////////////////////////////////////////////////////////////////
        System.out.println("++++++++++Цветы++++++++++");
        Flower rose = new Flower("Роза обыкновенная", "Голандия", 35.59);
        Flower chrysanthemum = new Flower("Хризантема", " ", 15, 5);
        Flower pion = new Flower("Пион", "Англия", 69.9, 1);
        Flower gypsophila = new Flower("Гипсофила", "Турция", 19.5, 10);
        System.out.println(chrysanthemum.toString());
        System.out.println("-----------------------------------------------------------------------------------------");

        Bouquet bouquet = new Bouquet(
                rose,rose,rose,
                chrysanthemum,chrysanthemum,chrysanthemum,chrysanthemum,chrysanthemum,
                gypsophila);
        System.out.printf("Стоимость букета: %.2f, и простоит: %d дня\n",bouquet.getCost(),bouquet.getLifeSpan());
        System.out.println("-----------------------------------------------------------------------------------------");

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        /////////////////////////////////////Автомобили/////////////////////////////////////////////////////////////////
        System.out.println("++++++++++Автомобили++++++++++");
        Car lada = new Car("Lada", "Grande", 1.7, "желтый", 2015,
                "Россия", "Механика", "Пикап", "В123BM75",
                4, new Car.Key(true, false),
                new Car.Insurance(2022,9,29, 7500.00, 123456789),160,"Бензин");
        Car audi = new Car("Audi", "A8", 3.0, "черный", 2020,
                "Германия", "Автомат", "Седан", "А212РР125",
                4, new Car.Key(true, true),
                new Car.Insurance(2021, 6, 25, 6752.00, 15351352),220,"Бензин");
        Car bmw = new Car("BMW", "Z8", 3.0, "черный", 2021,
                "Германия","Автомат", "Седан", "T777TT154",
                4, new Car.Key(true, true),
                new Car.Insurance(2023, 6, 25, 8500.00, 99351352),240,"Дизель");
        Car kia = new Car("KIA", "Sportage", 2.4, "красный", 2018,
                "Южная Корея","Автомат", "Кросовер", "X2100KO03",
                4, new Car.Key(true, true),
                new Car.Insurance(2022, 11, 25, 9400.00, 454551352),200,"Электро");
        Car hundai = new Car("Hyundai", "Avante", 1.6, "оранжевый", 2016,
                "Южная Корея","Автомат", "Седан", "К168ХС22",
                4, new Car.Key(true, true),
                new Car.Insurance(2022, 12, 10, 5300.00, 15312352),180,"Дизель");
        System.out.println(bmw.toString());
        bmw.refill();
        System.out.println("-----------------------------------------------------------------------------------------");
        System.out.println(lada.toString());
        lada.refill();
        System.out.println("-----------------------------------------------------------------------------------------");

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        /////////////////////////////////////Поезда/////////////////////////////////////////////////////////////////////
        System.out.println("++++++++++Поезда++++++++++");
        Train lastochka = new Train("Ласточка", "B-901", 2011, "Россия", "",
                301, 3500.00, 0, "Белорусский вокзал", "Минск-Пассажирский", 11,"Дизель");
        Train leningrad = new Train("Ленинград", "D-125", 2019, "Россия", "",
                270, 1700.00, 0, "Ленинградский вокзал", "Ленинград-Пассажирский", 8,"Дизель");
        System.out.println(lastochka.toString());
        System.out.println("-----------------------------------------------------------------------------------------");
        System.out.println(leningrad.toString());
        leningrad.refill();
        System.out.println("-----------------------------------------------------------------------------------------");

        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        /////////////////////////////////////Автобусы///////////////////////////////////////////////////////////////////
        System.out.println("++++++++++Автобусы++++++++++");
        Bus kamaz = new Bus("Камаз", "5299-40-57", 2018, "Россия", "Красный", 140,"Дизель");
        Bus gaz = new Bus("Газ", "Газель NEXT", 2017, "Россия", "Желтый", 160,"Дизель");
        Bus paz = new Bus("Паз", "32053/54", 2020, "Россия", "", 120,"Бензин");
        System.out.println(kamaz.toString());
        kamaz.refill();
        System.out.println("-----------------------------------------------------------------------------------------");
        System.out.println(gaz.toString());
        System.out.println("-----------------------------------------------------------------------------------------");
        System.out.println(paz.toString());
        paz.refill();
        System.out.println("-----------------------------------------------------------------------------------------");

    }
}